Revit 2024 API
SolidGeometryOptions Constructor
 Creates a new SolidOptions class with solid tag settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2019
Syntax
C#
public SolidGeometryOptions(
	int solidTag
)
Visual Basic
Public Sub New ( _
	solidTag As Integer _
)
Visual C++
public:
SolidGeometryOptions(
	int solidTag
)
Parameters
solidTag
Type: System.Int32
 The material id for the Solid.
See Also
SolidGeometryOptions Class
Autodesk.Revit.DB Namespace